cfm_webservice_la/src/test/resources/la_recv_response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
       <b:DRNADDO_REC xmlns:b="http://www.csc.smart/bo/schemas/DRNADDO">
         <STATUS>0</STATUS>
         <MORE_IND>N</MORE_IND>
         <ADDITIONAL_FIELDS>
            <DRNOUTRECS>
               <STATUS>SC</STATUS>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
              <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
              <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
           </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
              <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
         </ADDITIONAL_FIELDS>
      </b:DRNADDO_REC>
   </soapenv:Body>
</soapenv:Envelope>